<template>
	<view class="container">
		<view class="privacy_box u-flex-col">
			<u-parse :html="content"></u-parse>
		</view>
	</view>
</template>

<script>
	export default{
		data(){
			return{
				tag:"user",
				content:`
				<p>在此特别提醒您(用户)在注册成为拼拼有礼平台(以下简称“平台”)的用户之前，请认真阅读本《用户协议》(以下简称“协议”)，确保您充分理解本协议中各条款，并审慎选择接受或不接受本协议。您的注册、登录、使用等行为将视为您认可并接受本协议各项条款的约束。本协议系明确平台向用户提供服务过程中双方的权利义务。“用户”是指注册、登录、使用本服务的个人。本协议可由平台随时更新，更新后的协议条款一旦公布即代替原来的协议条款，用户可在本APP中查阅最新版协议条款。在修改协议条款后，如果用户不接受修改后的条款，请立即停止使用平台提供的服务，用户继续使用服务将被视为接受修改后的协议。</p>
			<p class="bold">一、账号注册</p>
			<p>1、用户在使用本服务前需要注册一个平台账号。平台账号应当使用用户实名认证的手机号码绑定注册，请用户使用尚未与平台账号绑定的手机号码，以及未被服务根据本协议封禁的手机号码注册平台账号。服务可以根据用户需求或产品需要对账号注册和绑定的方式进行变更，而无须事先通知用户。</p>
			<p>2、“拼拼有礼”是一个社交电商平台，在用户注册及使用本平台时，平台需要搜集能识别用户身份的个人信息以便服务可以在必要时联系用户，或为用户提供更好的使用体验。平台搜集的信息包括但不限于用户的姓名、地址;平台同意对这些信息的使用将受限于本协议第二条用户个人隐私信息保护的约束，故用户完成注册即表明用户同意服务提取、公开及使用用户的信息。</p>
			<p>3、鉴于账号的绑定注册方式，用户同意在注册时将手机号码及手机设备识别码等信息用于注册。</p>
			<p class="bold">二、用户个人隐私信息保护</p>
			<p>1、如果平台发现或收到他人举报或投诉用户违反本协议约定的，平台有权不经通知随时对相关内容，包括但不限于用户资料、发贴记录进行审查、删除，并视情节轻重对违规账号处以包括但不限于警告、账号封禁、设备封禁、功能封禁等处罚，并通知用户处理结果。</p>
			<p>2、因违反本协议被封禁的用户，可以自行与平台联系。其中，被实施功能封禁的用户会在封禁期届满后自动恢复被封禁功能。被封禁用户可提交申诉，平台将对申诉进行审查，并合理判断决定是否变更处罚措施。</p>
			<p>3、用户理解并同意，平台有权依合理判断对违反有关法律法规或本协议规定的行为进行处罚，对违法违规的任何用户采取适当的法律行动，并依据法律法规保存有关信息向有关部门报告等，用户应承担由此而产生的一切法律责任。</p>
			<p>4、用户理解并同意，因用户违反本协议约定而导致或产生的任何第三方主张的任何索赔、要求或损失，都由用户自行承担，因用户行为给平台与合作公司、关联公司受到损害的，应予以赔偿(损失包括但不限于平台与合作公司、关联公司支出的律师费、诉讼费、保全费等)。</p>
			<p class="bold">三、用户发布内容规范</p>
			<p>1、本条所述内容是指用户使用服务的过程中所制作、上载、复制、发布、传播的任何内容，包括但不限于账号头像、名称、用户说明等注册信息及认证资料，或文字、语音、图片、视频、图文等发送、回复或自动回复消息和相关链接页面，以及其他使用账号或本服务所产生的内容。2、用户不得利用账号或本服务制作上载、复制、发布、传播如下法律、法规和政策禁止的内容:</p>
			<p>(1)反对宪法所确定的基本原则的;</p>
			<p>(2)危害国家安全，泄露国家秘密，颠覆国家政权，破坏国家统一的;</p>
			<p>(3)损害国家荣誉和利益的;</p>
			<p>(4)煽动民族仇恨、民族歧视，破坏民族团结的;</p>
			<p>(5)破坏国家宗教政策，宣扬邪教和封建迷信的;</p>
			<p>(6)散布谣言，扰乱社会秩序，破坏社会稳定的;</p>
			<p>(7)散布淫秽、色情、赌博、暴力、凶杀、恐怖或者教唆犯罪的;</p>
			<p>(8)侮辱或者诽谤他人，侵害他人合法权益的;</p>
			<p>(9)含有法律、行政法规禁止的其他内容的信息。</p>
			<p>3、用户不得利用账号或本服务制作、上载、复制、发布、传播如下干扰“服务”正常运营，以及侵犯其他用户或第三方合法权益的内容:</p>
			<p>(1)含有任何性或性暗示的;</p>
			<p>(2)含有辱骂、恐吓、威胁内容的;</p>
			<p>(3)含有骚扰、垃圾广告、恶意信息、诱骗信息的;</p>
			<p>(4)涉及他人隐私、个人信息或资料的;</p>
			<p>(5)侵害他人名誉权、肖像权、知识产权、商业秘密等合法权利的;</p>
			<p>(6)含有其他干扰本服务正常运营和侵犯其他用户或第三方合法权益内容的信息。</p>
			<p class="bold">四、使用规则</p>
			<p>1、用户在平台中或通过本平台所传送、发布的任何内容并不反映或代表，也不得被视为反映或代表平台的观点、立场或政策，平台对此不承担任何责任。</p>
			<p>2、用户不得利用账号或本服务进行如下行为:</p>
			<p>(1)提交、发布虚假信息，或盗用他人头像或资料，冒充、利用他人名义的:。</p>
			<p>(2)强制、诱导其他用户关注、点击链接页面或分享信息的;</p>
			<p>(3)虚构事实、隐瞒真相以误导、欺骗他人的;</p>
			<p>(4)利用技术手段批量建立虚假账号的;</p>
			<p>(5)利用账号或本服务从事任何违法犯罪活动的;</p>
			<p>(6)制作、发布与以上行为相关的方法、工具，或对此类方法、工具进行运营或传播，无论这些行为是否为商业目的;</p>
			<p>(7)其他违反法律法规规定、侵犯其他用户合法权益、干扰正常运营或服务未明示授权的行为。</p>
			<p>3、用户须对利用账号或本服务传送信息的真实性、合法性、无害性、准确性、有效性等全权负责，与用户所传播的信息相关的任何法律责任由用户自行承担，与平台无关。如因此给平台或第三方造成损害的，用户应当依法予以赔偿。</p>
			<p>4、平台提供的服务中可能包括广告，用户同意在使用过程中显示平台和第三方供应商、合作伙伴提供的广告。除法律法规明确规定外，用户应自行对依该广告信息进行的交易负责，对用户因依该广告信息进行的交易或前述广告商提供的内容而遭受的损失或损害，平台不承担任何责任。</p>
			<p class="bold">五、退换货条款</p>
			<p>1、拼拼有礼是一家以社交团购为核心服务的平台。以娱乐的方式参与购物，由于其定价、购物方式的特殊性,用户在参与购买前应当谨慎考虑确定是否参与购买，若用户在谨慎考虑后依然选择参与购买的，则视为用户同意。</p>
			<p>2、由于拼团区产品利润分配的特殊性，用户在参与拼团前应当谨慎考虑是丕参与拼团一若里户在谨慎考虑后依然选择参与拼团的，则视为用户同意:拼团区产品拼中后，若无质量问题，不支持七天无理由退货退款。用户认为产品质量存在问题的，仅可向平台申请换货，经平台审查后确定产品质量确有问题的，可为用户换货。</p>
			<p>3、用户退货退款前，如已享受平台奖励的，发生退货退款时，不给予退还奖励，否则平台有权拒绝用户的退货退款申请。用户无论以何种理由退货退款的，该商品订单均在用户申请退货退进行结束订单不可再自行发起售后操作。</p>
			<p class="bold">六、其他</p>
			<p>1、平台郑重提醒用户注意本协议中免除平台责任和限制用户权利的条款，请用户仔细阅读，自主考虑风险。未成年人应在法定监护人的陪同下阅读本协议。</p>
			<p>2、本协议的效力、解释及纠纷的解决，适用于中华人民共和国法律。若用户和平台之间发生任何纠纷或争议,首先应友好协商解决，协商不成的，用户同意将纠纷或争议提交平台住所地有管辖权的人民法院管辖。</p>
			<p>3、本协议的任何条款无论因何种原因无效或不具可执行性，其余条款仍有效，对双方具有约束力。本《协议》版权由平台所有，平台保留一切对本《协议》解释的权利。</p>
			`,
			content2:
			`
			<p style="text-align:right;">本版本更新时间：2021年5月1日</p>
			<p style="border-bottom:1px #f5f5f5 solid;line-height:25px;">欢迎您使用拼拼有礼</p>
			<p>拼拼有礼优享会员服务由杭州千俞供应链管理有限公司(以下亦称“千俞供应链”或“拼拼有礼”)向您提供。</p>
			<p>《拼拼有礼优享会员服务协议》(以下亦称“本协议”)由您(以下亦称“会员”或“优享会员”)和拼拼有礼进行缔结，对双方具有同等法律效力。拼拼有礼建议您仔细阅读本协议的全部内容，尤其是以加粗形式展示的，与您的权益(可能)存在重大关系的条款(包括相关约定品牌有礼责任、您享有的权利、争议解决方式及司法管辖等条款)，请您留意重点阅读。若您认为本协议中的加粗条款可能会导致您的部分或全部权利或利益受损，请您务必再次仔细阅读，在确保您已经理解、接受了加粗条款的前提下，继续使用拼拼有礼优享会员服务。</p>
			<p>如果您不同意本协议的任一或全部条款内容，请不要以确认形式(包括但不限于支付行为/接受赠与、或完成了成为优享会员的全部程序而在此过程中未向拼拼有礼提出关于本协议的任何异议、或使用优享会员服务)进行下一步操作或使用拼拼有礼优享会员服务。当您以确认形式进行下一步操作或使用拼拼有礼优享会员服务时，即表示您与壬俞供应链已达成协议关系，您自愿接受本协议并遵守本协议项下的全部约定。</p>
			<p>拼拼有礼有权变更本协议内容，一旦本协议内容发生变更的，拼拼有礼将在相应页面、站内信或以其他合理方式进行通知，请您仔细阅读。如果您不同意变更的内容的，您可以选择停止使用优享会员服务。如您继续使用优享会员服务的，则视为您已经同意变更的全部内容。</p>
			<p>更新后的协议自文首更新之日起生效。若您是未成年人，请您在监护人监护、指导下阅读并决定是否同意本协议。</p>
			<p class="bold">一、服务说明</p>
			<p>1.【拼拼有礼优享会员】是指完成了成为优享会员的所有程序，且遵守本协议的前提下，在会员时长有效期内享受拼拼有礼提供的优享会员服务的自然人。</p>
			`
			}
		},
		onLoad(option){
			let ptitle = "";
			if(option.type){
				switch(option.type){
					case "2":
						ptitle = "隐私协议";
						this.tag = "secret";
					break;
					case "3":
						ptitle = "会员服务协议";
						this.tag = "vip";
						this.content = this.content2;
					break;
				}
			}else{
				ptitle = "用户协议";
			}
			uni.setNavigationBarTitle({
				title: ptitle
			});
			this.$http.getArticle(this.tag).then((res)=>{
				this.content = res.data.content;
			})
		}
	}
</script>

<style lang="scss">
	page{background:#ffffff;}
	.privacy_box{
		padding:28rpx 40rpx;
		font-size: 24rpx;
		color:rgba(0,0,0,0.74);
		p{
			padding-top:20rpx;
		}
		.bold{
			color:#000000;
			font-weight: bold;
		}
	}
</style>
